#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.TEST-DELETE-CLIENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["TEST-DELETE-CLIENT-SERVICE/second-test-role"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.TEST-DELETE-CLIENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["TEST-DELETE-CLIENT-SERVICE/third-test-role"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.TEST-DELETE-CLIENT-SERVICE.module.client-roles.keycloak_role.ROLES["first-test-role"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "first-test-role"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.TEST-DELETE-CLIENT-SERVICE.module.client-roles.keycloak_role.ROLES["fourth-test-role"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "fourth-test-role"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.TEST-DELETE-CLIENT-SERVICE.module.client-roles.keycloak_role.ROLES["second-test-role"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "second-test-role"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.TEST-DELETE-CLIENT-SERVICE.module.client-roles.keycloak_role.ROLES["third-test-role"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "third-test-role"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.TEST-DELETE-CLIENT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["offline_access"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "offline_access"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.TEST-DELETE-CLIENT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["uma_authorization"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "uma_authorization"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.TEST-DELETE-CLIENT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["TEST-DELETE-CLIENT-SERVICE/first-test-role"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "first-test-role"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.TEST-DELETE-CLIENT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["TEST-DELETE-CLIENT-SERVICE/second-test-role"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "second-test-role"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.TEST-DELETE-CLIENT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["TEST-DELETE-CLIENT-SERVICE/third-test-role"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "third-test-role"
      + service_account_user_id = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*